<template>
  <div class="p-4">
    <div class="row">
      <div class="col-3">
        <h3>คืนความยุติธรรมให้พี่เตี้ย</h3>
        <h5>
          วันที่เข้าชื่อเสนอ 28 กรกฎาคม พ.ศ.2563
        </h5>
        <button type="button" class="btn btn-sm btn-info" disabled>
          จำนวนโหวตรอบนี้ : 1280 คน
        </button>
        <img
          src="/logo.svg"
          class="center"
          style="width: 200px; height: 200px; margin-top: 5%;"
        />
      </div>
      <!--  -->
      <div class="col-6">
        <div class="px-2 d-flex justify-content-center bg-white">
          <div style="overflow: auto; height: 80vh; width: 100%;" class="p-4">
            <div class="card-content">
              <p style="font-size: 24px; font-family: Sarabun;">
                รัฐธรรมนูญแห่งราชอาณาจักรไทย มาตรา ๑๖๓
                กำหนดในเรื่องการเข้าชื่อเสนอกฎหมาย
                ไว้โดยให้ประชาชนผู้มีสิทธิเลือกตั้ง
                ไม่น้อยกว่าหนึ่งหมื่นคนร่วมกันเข้าชื่อเสนอกฎหมายได้
                และกฎหมายที่จะเสนอต้องเป็นกฎหมายที่มีหลักการตามที่กำหนดไว้ใน
                หมวด ๓ สิทธิและ เสรีภาพของชนชาวไทย หรือหมวด ๕
                แนวนโยบายพื้นฐานแห่งรัฐ ของรัฐธรรมนูญแห่ง ราชอาณาจักรไทย
                การให้อำนาจประชาชนร่วมกันเข้าชื่อเสนอกฎหมายดังกล่าว
                เป็นการเปิดโอกาสให้ประชาชนมีส่วนร่วมทางการเมืองในระบอบประชาธิปไตยมากขึ้น
                การเข้าชื่อเสนอกฎหมายนอกจากจะอาศัยบทบัญญัติ มาตรา ๑๖๓
                ของรัฐธรรมนูญ แห่งราชอาณาจักรไทยแล้ว
                ยังมีกฎหมายอื่นที่เกี่ยวข้องในการกำหนดหลักเกณฑ์ ขั้นตอน
                และวิธีการเข้าชื่อเสนอกฎหมาย คือ
                พระราชบัญญัติว่าด้วยการเข้าชื่อเสนอกฎหมาย พ.ศ. ๒๕๔๒
                เป็นการอนุโลมมาใช้บังคับเท่าที่ไม่ขัดกับรัฐธรรมนูญ
                เพราะเนื่องจาก ได้มีการใช้รัฐธรรมนูญแห่งราชอาณาจักรไทย
                พุทธศักราช ๒๕๕๐ แล้วและยังมิได้แก้ไข
                พระราชบัญญัติว่าด้วยการเข้าชื่อเสนอกฎหมาย พ.ศ. ๒๕๔๒
                ให้เป็นไปตามรัฐธรรมนูญ ฉบับปัจจุบัน
                และยังมีกฎหมายที่เกี่ยวข้องอีก คือ ประกาศรัฐสภา เรื่อง หลักเกณฑ์
                และวิธีการดำเนินการเข้าชื่อเสนอกฎหมาย
                และระเบียบคณะกรรมการการเลือกตั้งว่าด้วย
                วิธีปฏิบัติในการจัดให้มีการเข้าชื่อเสนอกฎหมายและหลักเกณฑ์การขอใช้สิทธิเข้าชื่อ
                นอกเขตและการตรวจสอบ พ.ศ. ๒๕๔๒ ผู้มีสิทธิเข้าชื่อเสนอกฎหมาย
                ผู้มีสิทธิเข้าชื่อ
                เสนอกฎหมายจะต้องเป็นผู้มีสิทธิเลือกตั้งสมาชิกสภาผู้แทนราษฎร
                ตามบทบัญญัติของ รัฐธรรมนูญแห่งราชอาณาจักรไทยได้บัญญัติไว้ ดังนี้
                มาตรา ๙๙ บุคคลผู้มีสมบัติดังต่อไปนี้ เป็นผู้มีสิทธิเลือกตั้ง (๑)
                มีสัญชาติไทย แต่บุคคลผู้มีสัญชาติไทยโดยการแปลงสัญชาติ
                ต้องได้สัญชาติไทยมาแล้วไม่น้อยกว่าห้าปี (๒)
                มีอายุไม่ต่ำกว่าสิบแปดปีบริบูรณ์ในวันที่ ๑
                มกราคมของปีที่มีการเลือกตั้ง (๓)
                มีชื่ออยู่ในทะเบียนบ้านในเขตเลือกตั้งมาแล้วเป็นเวลาไม่น้อยกว่าเก้าสิบวัน
                นับถึงวันเลือกตั้งผู้มีสิทธิเลือกตั้งซึ่งอยู่นอกเขตเลือกตั้งที่ตนมีชื่ออยู่ในทะเบียนบ้าน
                หรือมีชื่ออยู่ในทะเบียนบ้านในเขตเลือกตั้งเป็นเวลาน้อยกว่าเก้าสิบวันนับถึงวันเลือกตั้ง
                หรือมีถิ่นที่อยู่นอกราชอาณาจักร ย่อมมีสิทธิออกเสียงลงคะแนนตั้ง
                ทั้งนี้ ตามหลักเกณฑ์ วิธีการ
                และเงื่อนไขที่บัญญัติไว้ในพระราชบัญญัติประกอบรัฐธรรมนูญ
                ว่าด้วยการเลือกตั้งสมาชิกสภาผู้แทนราษฎรและการได้มาซึ่งสมาชิกวุฒิสภามาตรา
                ๑๐๐ บุคคลผู้มีลักษณะดังต่อไปนี้ในวันเลือกตั้ง
                เป็นบุคคลต้องห้ามไม่ให้ใช้สิทธิเลือกตั้ง (๑) เป็นภิกษุ สามเณร
                นักพรต หรือนักบวช (๒) อยู่ในระหว่างถูกเพิกถอนสิทธิเลือกตั้ง (๓)
                ต้องคุมขังอยู่โดยหมายของศาล หรือโดยคำสั่งที่ชอบด้วยกฎหมาย (๔)
                วิกลจริต หรือจิตฟั่นเฟือนไม่สมประกอบ ดังนั้น
                บุคคลผู้มีคุณสมบัติตามมาตรา ๙๙
                และไม่เป็นบุคคลที่มีลักษณะต้องห้าม
                มิให้ใช้สิทธิเลือกตั้งตามมาตรา ๑๐๐
                ของรัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช ๒๕๕๐ จึงถือเป็นบุคคล
                ผู้มีสิทธิเลือกตั้งที่จะมีสิทธิเข้าชื่อเสนอกฎหมายได้
                เมื่อผู้มีสิทธิเลือกตั้งผู้ใดร่วมลงชื่อในการเข้าชื่อเสนอกฎหมายโดยถูกต้องแล้ว
                จะถอนชื่อภายหลังมิได้
              </p>
            </div>
          </div>
        </div>
      </div>
      <!--  -->
      <div class="col-3">
        <div class="float-right">
          <button
            type="button"
            class="btn btn-sm btn-success"
            style="font-family: Sarabun; font-size: 22px;"
          >
            โหวตให้กฎหมายนี้
          </button>
        </div>
      </div>
      <!--  -->
    </div>
  </div>
</template>
<style scoped>
h5 {
  font-family: Sarabun;
  color: rgb(192, 192, 192);
  font-size: 24px;
}
</style>
